<template>
  <div class="Notice">
    <van-row v-for="(item,index)  of NoticeList" :key="index" :index="index">
      <div>
        <a class="active">
          <div @click="showDialog(item)">
            <p>{{item.title}}</p>
            <span>{{item.time}}</span>
          </div>
          <van-icon name="delete" size="1.5em" class="fr" />
        </a>
      </div>
    </van-row>
    <van-dialog v-model="show" title="消息详情" show-cancel-button>
      <van-row class="title">{{Dialog.title}}</van-row>
      <van-row class="content">{{Dialog.content}}</van-row>
    </van-dialog>
  </div>
</template>

<script>
// @ is an alias to /src
import { mapActions, mapGetters, mapMutations } from "vuex";
import { Toast } from "vant";

export default {
  name: "Notice",
  components: {},
  computed: {},
  data() {
    return {
      show: false,
      Dialog: { title: "", content: "", time: "" },
      NoticeList: [
        {
          id: 0,
          title: "支付宝强势上线了",
          content:
            "支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了",
          time: "2020-09-15 18:51:59",
        },
        {
          id: 1,
          title: "支付宝强势上线了",
          content:
            "支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了",
          time: "2020-09-15 18:51:59",
        },
        {
          id: 2,
          title: "支付宝强势上线了",
          content:
            "支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了",
          time: "2020-09-15 18:51:59",
        },
        {
          id: 3,
          title: "支付宝强势上线了",
          content:
            "支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了",
          time: "2020-09-15 18:51:59",
        },
        {
          id: 4,
          title: "支付宝强势上线了",
          content:
            "支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了",
          time: "2020-09-15 18:51:59",
        },
        {
          id: 5,
          title: "支付宝强势上线了",
          content:
            "支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了支付宝强势上线了",
          time: "2020-09-15 18:51:59",
        },
      ],
    };
  },
  mounted() {
    this.init();
  },
  methods: {
    // ...mapActions(["withdraw"]),
    init() {},
    showDialog(item) {
      this.Dialog = item;
      this.show = true;
    },
  },
};
</script>
<style lang="less">
.Notice {
  text-align: left;
  .active {
    display: flex;
    justify-content: space-between;
    align-items: center;
    padding: 10px 5%;
    span {
      font-size: 0.62em;
      clear: both;
      color: #989898;
    }
    a div {
      width: 12em;
      line-height: 1.25em;
      display: inline-block;
    }
  }

  .fr {
    float: right;
  }
  .van-dialog__content {
    padding: 1em;
    .title {
      padding: 0.2em;
      overflow: hidden;
      text-overflow: ellipsis;
      white-space: nowrap;
    }
    .content {
      padding: 0.2em;
      max-height: 10em;
      overflow-y: auto;
    }
  }
}
</style>